namespace ListReactiveProperty;

internal class TodoList
{
}
//todo : DPIが高いときにpdfiumのレンダリングがおかしくなる
//todo : 動画を読み込めるようにする。
//todo : 動画の再生、一時停止、停止、進む、戻るを可能にする。
//todo : シークバーを作り、動画のシークを可能にする。
//todo : 0.5ページ移動を可能にする。
//todo : マウスでスクロールできるようにする。
//todo : 拡大縮小を可能にする。
//todo : 操作中に自動表示のチェックボック
//todo : 動画の時以外に再生ボタンを表示しない
//todo : 回転のボタンの位置を調整
//todo : 回転のボタンの実装
//todo : ウインドウ幅に合わせるボタンの実装
//todo : 全体を表示ボタンの実装
//todo : メニューリストからリストの選択を可能にする
//todo : ページ指定ウインドウでエラーチェック
//todo : ファイル情報の表示
//todo : ファイルリストの保存
//todo : 背景色の変更が反映されない
//todo : ファイルリストの読み込み
//todo : ディスプレイの変更が反映されない
//todo : このアプリについての情報





